Revit.AnalysisDisplay.AbstractAnalysisDisplay.SetElementAndPrimitiveIdsForTrace(Autodesk.Revit.DB.Analysis.SpatialFieldManager,System.Collections.Generic.List{System.Int32})
Set the SpatialFieldManager and PrimitiveId in Thread Local Storage
manager:
primitiveIds: